rhoPimpleFoam_yplus1_omega98_1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; // has to be calculated

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }

    Cyli
    {
        type            nutkWallFunction;
        type            nutkWallFunction;
        value           uniform 0;
    }

    Botwall
    {
        type            nutkWallFunction;
        type            nutkWallFunction;
        value           uniform 0;
    }

    Outlet
    {
      type              zeroGradient;
    }

    Freestream
    {
        type            slip;
    }

    Side1
    {
        type            empty;
    }

    Side2
    {
        type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
